Masmiseim36/nxpSDK/boards/frdmk64f/demo_apps/bubble_peripheral/pin_mux.h
/*
 * The Clear BSD License
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/***********************************************************************************************************************

 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file

 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.

 **********************************************************************************************************************/



#ifndef _PIN_MUX_H_

#define _PIN_MUX_H_



/*!

 * @addtogroup pin_mux

 * @{

 */



/***********************************************************************************************************************

 * API

 **********************************************************************************************************************/



#if defined(__cplusplus)

extern "C" {

#endif



/*!

 * @brief Calls initialization functions.

 *

 */

void BOARD_InitBootPins(void);



#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */



/*! @name PORTB16 (number 62), U7[4]/UART0_RX

  @{ */

#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */

#define BOARD_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */

                                       /* @} */



/*! @name PORTB17 (number 63), U10[1]/UART0_TX

  @{ */

#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */

#define BOARD_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */

                                       /* @} */



/*! @name PORTB22 (number 68), D12[1]/LEDRGB_RED

  @{ */

#define BOARD_LED_RED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */

#define BOARD_LED_RED_PORT PORTB /*!<@brief PORT device name: PORTB */

#define BOARD_LED_RED_PIN 22U    /*!<@brief PORTB pin index: 22 */

                                 /* @} */



/*! @name PORTE26 (number 33), J2[1]/D12[4]/LEDRGB_GREEN

  @{ */

#define BOARD_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */

#define BOARD_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */

#define BOARD_LED_GREEN_PIN 26U    /*!<@brief PORTE pin index: 26 */

                                   /* @} */



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_InitPins(void);



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_I2C_ConfigurePins(void);



/*! @name PORTE24 (number 31), J2[20]/U8[4]/I2C0_SCL

  @{ */

#define BOARD_ACCEL_I2C_SCL_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */

#define BOARD_ACCEL_I2C_SCL_PORT PORTE /*!<@brief PORT device name: PORTE */

#define BOARD_ACCEL_I2C_SCL_PIN 24U    /*!<@brief PORTE pin index: 24 */

                                       /* @} */



/*! @name PORTE25 (number 32), J2[18]/U8[6]/I2C0_SDA

  @{ */

#define BOARD_ACCEL_I2C_SDA_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */

#define BOARD_ACCEL_I2C_SDA_PORT PORTE /*!<@brief PORT device name: PORTE */

#define BOARD_ACCEL_I2C_SDA_PIN 25U    /*!<@brief PORTE pin index: 25 */

                                       /* @} */



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_Init_I2C_GPIO_pins(void);



#if defined(__cplusplus)

}

#endif



/*!

 * @}

 */

#endif /* _PIN_MUX_H_ */



/***********************************************************************************************************************

 * EOF

 **********************************************************************************************************************/

